{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "\u05d0",
    "1": "\u05d1",
    "2": "\u05d2",
    "3": "\u05d3",
    "4": "\u05d4",
    "5": "\u05d5",
    "6": "\u05d6",
    "7": "\u05d7",
    "8": "\u05d8",
    "9": "\u05d9",
    "10": "\u05db",
    "11": "\u05da",
    "12": "\u05dc",
    "13": "\u05de",
    "14": "\u05dd",
    "15": "\u05e0",
    "16": "\u05df",
    "17": "\u05e1",
    "18": "\u05e2",
    "19": "\u05e4",
    "20": "\u05e3",
    "21": "\u05e6",
    "22": "\u05e5",
    "23": "\u05e7",
    "24": "\u05e8",
    "25": "\u05e9",
    "26": "\u05ea"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\u05d0": 0,
    "\u05d1": 1,
    "\u05d2": 2,
    "\u05d3": 3,
    "\u05d4": 4,
    "\u05d5": 5,
    "\u05d6": 6,
    "\u05d7": 7,
    "\u05d8": 8,
    "\u05d9": 9,
    "\u05da": 11,
    "\u05db": 10,
    "\u05dc": 12,
    "\u05dd": 14,
    "\u05de": 13,
    "\u05df": 16,
    "\u05e0": 15,
    "\u05e1": 17,
    "\u05e2": 18,
    "\u05e3": 20,
    "\u05e4": 19,
    "\u05e5": 22,
    "\u05e6": 21,
    "\u05e7": 23,
    "\u05e8": 24,
    "\u05e9": 25,
    "\u05ea": 26
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.2"
}
